Jiahao-Liu29/Esp8266_DeskBox/src/mySD1/src/main.cpp
#include <ESP8266WiFi.h>
#include <DNSServer.h>
#include <ESP8266WebServer.h>
#include <ESP8266HTTPClient.h>
#include <WiFiManager.h>         //https://github.com/tzapu/WiFiManager
#include <TFT_eSPI.h>
#include <EEPROM.h>
#include <WiFiUdp.h>
#include <TimeLib.h>
#include <Button2.h>
#include <SPI.h>
#include <TJpg_Decoder.h>
#include <ArduinoJson.h>

#include "weathernum.h"

// font
#include "font/font_t1_64x80.h"
#include "font/font_zhong.h"
#include "font/font_zhongCity28.h"
#include "font/font_t2_60x64.h"
#include "font/font_t2_64.h"

// icon
#include "img/icon/icon_temp.h"
#include "img/icon/icon_weath.h"
#include "img/icon/icon_wifibmp.h"
#include "img/icon/icon_set.h"

#define Version  "mySD V1.0.0"

/* 定义按钮引脚 */
Button2 Button_sw1 = Button2(4); 
Button2 Button_UP  = Button2(D0, INPUT_PULLDOWN_16, false);

/* tft 相关参数 */
#define LCD_BL_PIN 5
TFT_eSPI tft = TFT_eSPI();
TFT_eSprite eSprite = TFT_eSprite(&tft);

uint8_t LCD_Rotation = 0;   //LCD屏幕方向
uint8_t LCD_BL_PWM = 50;//屏幕亮度0-100，默认50
#define tft_CalBL(x)    ((int)(1023 - ((100 - (x))*10)))

/* 系统各项参数 */
uint8_t updata_flag = 1;
int weaterTime = 0; //天气更新时间记录
uint8_t Wifi_en = 1; //wifi状态标志位  1：打开    0：关闭
int updateweater_time = 1;
bool infoShow = false;

/* 网络相关配置 */
WiFiManager wm;
struct config_type
{
  char stassid[32];//定义配网得到的WIFI名长度(最大32字节)
  char stapsw[64];//定义配网得到的WIFI密码长度(最大64字节)
};

//---------------修改此处""内的信息--------------------
//如开启WEB配网则可不用设置这里的参数，前一个为wifi ssid，后一个为密码
config_type wificonf ={{"huawei"},{"20020903ljh"}};

/* EEPROM 参数 */
int BL_addr = 1;      //被写入数据的EEPROM地址编号  1 亮度
int Ro_addr = 2;      //被写入数据的EEPROM地址编号  2 旋转方向
int weather_addr = 3; //被写入数据的EEPROM地址编号  3 天气更新间隔
int City_addr = 10;   //被写入数据的EEPROM地址编号  10 城市
int wifi_addr = 40;   //被写入数据的EEPROM地址编号  40 wifi-ssid-psw

/* NTP 获取时间参数 */
WiFiUDP udp;
uint16_t localPort = 8000;
time_t prevDisplay = 0;       //显示时间显示记录
//NTP服务器参数
static const char ntpServerName[] = "ntp6.aliyun.com";
const int timeZone = 8;     //东八区

/* api 接口信息 */
WiFiClient wifiClient;
String AK = "XnGaK9n8X5oQc3GWm1EacC9TxQ9lwXma";
String host = "api.map.baidu.com";

char cityArray[32] = {"洛龙区"};
String cityID;

/* 天气对象 */
WeatherNum  wrat;
struct nowWeather_Info
{
  String text;          // 天气
  int temp;             // 温度
  int feels_like;       // 体感温度
  int rh;               // 相对湿度
  String wind_class;    // 风力等级
  String wind_dir;      // 风向描述
};
struct forecasts_Info
{
  String text_day;      // 白天天气
  String text_night;    // 夜晚天气
  int high;             // 最高温度
  int low;              // 最低温度
  String wc_day;        // 白天风力
  String wd_day;        // 白天风向
  String wc_night;      // 夜晚风力
  String wd_night;      // 夜晚风向
  String week;          // 星期
};

nowWeather_Info weatherInfo = {};
forecasts_Info  forecastsInfo[5] = {};

/* 状态机 */
uint8_t menu_num = 3;
uint16_t menu_flag = 0;

#define LOW_POWER     0x0001  // 低功耗界面
#define MAIN_MENU     0x0002  // 多功能界面
#define SET_MENU      0x0004  // 设置界面
#define SELECT_MENU   0x0008  // 设置子界面
#define ISSAVE_MENU   0x0010  // 是否保存界面

/* 获取天气信息 */
void weatherInfoGet(WiFiClient client)
{
  const size_t capacity = 2048;
  DynamicJsonDocument doc(capacity);

  deserializeJson(doc, client);

  JsonObject result = doc["result"];
  JsonObject now = result["now"];

  weatherInfo.text = now["text"].as<String>();
  weatherInfo.temp = now["temp"].as<int>();
  weatherInfo.feels_like = now["feels_like"].as<int>();
  weatherInfo.rh = now["rh"].as<int>();
  weatherInfo.wind_class = now["wind_class"].as<String>();
  weatherInfo.wind_dir = now["wind_dir"].as<String>();

  for (uint8_t i = 0; i < 5; i ++) {
    forecastsInfo[i].text_day = result["forecasts"][i]["text_day"].as<String>();
    forecastsInfo[i].text_night = result["forecasts"][i]["text_night"].as<String>();
    forecastsInfo[i].high = result["forecasts"][i]["high"].as<int>();
    forecastsInfo[i].low = result["forecasts"][i]["low"].as<int>();
    forecastsInfo[i].wc_day = result["forecasts"][i]["wc_day"].as<String>();
    forecastsInfo[i].wd_day = result["forecasts"][i]["wd_day"].as<String>();
    forecastsInfo[i].wc_night = result["forecasts"][i]["wc_night"].as<String>();
    forecastsInfo[i].wd_night = result["forecasts"][i]["wd_night"].as<String>();
    forecastsInfo[i].week = result["forecasts"][i]["week"].as<String>();
  }

  Serial.printf("info: 天气：%c\t温度：%d\t体感温度：%d\t相对湿度：%d\n", weatherInfo.text, weatherInfo.temp, weatherInfo.feels_like, weatherInfo.rh);
}

// https://api.map.baidu.com/weather/v1/?district_id=222405&data_type=all&ak=XnGaK9n8X5oQc3GWm1EacC9TxQ9lwXma
void weatherRequest(String district_id)
{
  String GetUrl = "/weather/v1/?ak=";
  GetUrl += AK;
  GetUrl += "&data_type=all&district_id=";
  GetUrl += district_id;

  String requestUrl = String("GET ") + GetUrl + " HTTP/1.1\r\n" +
                            "Host: " + host + "\r\n" +
                            "Connection: close\r\n\r\n";

  // 向服务器发送 http 请求
  wifiClient.print(requestUrl);
  Serial.print("Creat a request: ");
  Serial.println("https://" + host + GetUrl);

  // 获取并显示服务器响应状态行 
  String status_response = wifiClient.readStringUntil('\n');
  Serial.print("status_response: ");
  Serial.println(status_response);

  // 使用find跳过HTTP响应头
  if (wifiClient.find("\r\n\r\n")) {
      Serial.println("Found Header End. Start Parsing.");
  }

  weatherInfoGet(wifiClient);
}

/* 获取城市id */
void cityInfoGet(WiFiClient client) 
{
  const size_t capacity = JSON_ARRAY_SIZE(0) + JSON_ARRAY_SIZE(1) + 2*JSON_OBJECT_SIZE(4) + 94;
  DynamicJsonDocument doc(capacity);

  deserializeJson(doc, client);

  JsonObject result = doc["districts"][0];

  cityID = result["code"].as<String>();
  Serial.print("Get cityId: ");
  Serial.println(result["code"].as<String>());
}

// https://api.map.baidu.com/api_region_search/v1/?keyword=洛龙区&sub_admin=0&extensions_code=1&ak=XnGaK9n8X5oQc3GWm1EacC9TxQ9lwXma
void cityIDRequest(String city)
{
  String GetUrl = "/api_region_search/v1/?ak=";
  GetUrl += AK;
  GetUrl += "&sub_admin=0&extensions_code=1&keyword=";
  GetUrl += city;

  String requestUrl = String("GET ") + GetUrl + " HTTP/1.1\r\n" +
                            "Host: " + host + "\r\n" +
                            "Connection: keep-alive\r\n\r\n";

