Jiahao-Liu29/Esp8266_DeskBox/src/mySD1/src/main.cpp
  // 向服务器发送 http 请求
  wifiClient.print(requestUrl);
  Serial.print("Creat a request: ");
  Serial.println("https://" + host + GetUrl);

  // 获取并显示服务器响应状态行 
  String status_response = wifiClient.readStringUntil('\n');
  Serial.print("status_response: ");
  Serial.println(status_response);

  // 使用find跳过HTTP响应头
  if (wifiClient.find("\r\n\r\n")) {
      Serial.println("Found Header End. Start Parsing.");
  }

  cityInfoGet(wifiClient);
}

//TFT屏幕输出函数
bool tft_output(int16_t x, int16_t y, uint16_t w, uint16_t h, uint16_t* bitmap)
{
  if ( y >= tft.height() ) return 0;
  tft.pushImage(x, y, w, h, bitmap);
  // Return 1 to decode next block
  return 1;
}

//进度条函数
byte loadNum = 6;
void loading(byte addtime)//绘制进度条
{
  eSprite.setColorDepth(8);
  
  eSprite.createSprite(200, 100);//创建窗口
  eSprite.fillSprite(0x0000);   //填充率

  eSprite.drawRoundRect(0,0,200,16,8,0xFFFF);       //空心圆角矩形
  eSprite.fillRoundRect(3,3,loadNum,10,5,0xFFFF);   //实心圆角矩形
  eSprite.setTextDatum(CC_DATUM);   //设置文本数据
  eSprite.setTextColor(TFT_GREEN, 0x0000); 
  eSprite.drawString("Connecting to WiFi......",100,40,2);
  eSprite.setTextColor(TFT_WHITE, 0x0000); 
  eSprite.drawRightString(Version,180,60,2);
  eSprite.pushSprite(20,120);  //窗口位置
  
  eSprite.deleteSprite();
  loadNum += 1;
  delay(addtime);
}

String getParam(String name){
  //read parameter from server, for customhmtl input
  String value;
  if(wm.server->hasArg(name)) {
    value = wm.server->arg(name);
  }
  return value;
}

//WEB配网LCD显示函数
void Web_win()
{
  eSprite.setColorDepth(8);
  
  eSprite.createSprite(200, 60);//创建窗口
  eSprite.fillSprite(0x0000);   //填充率

  eSprite.setTextDatum(CC_DATUM);   //设置文本数据
  eSprite.setTextColor(TFT_GREEN, 0x0000); 
  eSprite.drawString("WiFi Connect Fail!",100,10,2);
  eSprite.drawString("SSID:",45,40,2);
  eSprite.setTextColor(TFT_WHITE, 0x0000); 
  eSprite.drawString("AutoConnectAP",125,40,2);
  eSprite.pushSprite(20,50);  //窗口位置
    
  eSprite.deleteSprite();
}

void saveParamCallback()
{
  String city;

  // updateweater_time = getParam("WeaterUpdateTime").toInt();
  city =  getParam("CityCode");
  LCD_Rotation = getParam("set_rotation").toInt();
  LCD_BL_PWM = getParam("LCDBL").toInt();
  updateweater_time = getParam("WeaterUpdateTime").toInt();

  // 城市
  strcpy(cityArray, city.c_str());
  Serial.println(cityArray);
  // 读出 eeprom 中的城市信息
  char temp_city[32];
  uint8_t *data = (uint8_t*)(&temp_city);
  for (uint8_t i = 0; i < sizeof(temp_city); i++)
  {
    *(data + i) = EEPROM.read(i + City_addr);
  }
  Serial.print("temp city: ");
  Serial.println(temp_city);
  if(temp_city != cityArray) {
    // 写入城市信息
    uint8_t *p = (uint8_t*)(&cityArray);
    for (uint8_t i = 0; i < sizeof(cityArray); i++)
    {
      EEPROM.write(i + City_addr, *(p + i)); //在闪存内模拟写入
    }
    delay(10);
    EEPROM.commit();//执行写入ROM
    delay(10);
  }
  
  // 屏幕方向
  if(EEPROM.read(Ro_addr) != LCD_Rotation) {
    EEPROM.write(Ro_addr, LCD_Rotation);
    EEPROM.commit();
    delay(5);
  }
  tft.setRotation(LCD_Rotation);
  tft.fillScreen(TFT_BLACK);
  Web_win();
  loadNum--;
  loading(1);

  // 屏幕亮度
  if(EEPROM.read(BL_addr) != LCD_BL_PWM)
  {
    EEPROM.write(BL_addr, LCD_BL_PWM);
    EEPROM.commit();
    delay(5);
  }
  analogWrite(LCD_BL_PIN, tft_CalBL(LCD_BL_PWM));

  // 天气更新间隔
  if(EEPROM.read(weather_addr) != updateweater_time) 
  {
    EEPROM.write(weather_addr, updateweater_time);
    EEPROM.commit();
    delay(5);
  }
}

//WEB配网函数
void WebConfig()
{
  WiFi.mode(WIFI_STA);

  delay(3000);

  wm.resetSettings();

  const char* set_rotation = "<br/><label for='set_rotation'>显示方向设置</label><br>\
                            <div style='text-align:center;'>\
                            <input type='radio' name='set_rotation' value='0' checked> USB接口朝下<br>\
                            <input type='radio' name='set_rotation' value='1'> USB接口朝右<br>\
                            <input type='radio' name='set_rotation' value='2'> USB接口朝上<br>\
                            <input type='radio' name='set_rotation' value='3'> USB接口朝左</div>";

  WiFiManagerParameter  custom_rot(set_rotation);
  WiFiManagerParameter  custom_bl("LCDBL","屏幕亮度(1-100)","50",3);

  WiFiManagerParameter  custom_weatertime("WeaterUpdateTime","天气刷新时间（分钟）","10",3);
  WiFiManagerParameter  custom_cc("CityCode","城市代码","洛龙区",9);
  WiFiManagerParameter  p_lineBreak_notext("<p></p>");

  wm.addParameter(&p_lineBreak_notext);
  wm.addParameter(&custom_cc);
  wm.addParameter(&p_lineBreak_notext);
  wm.addParameter(&custom_bl);
  wm.addParameter(&p_lineBreak_notext);
  wm.addParameter(&custom_weatertime);
  wm.addParameter(&p_lineBreak_notext);
  wm.addParameter(&custom_rot);

  wm.setSaveParamsCallback(saveParamCallback);
  std::vector<const char *> menu = {"wifi","restart"};
  wm.setMenu(menu);
  wm.setClass("invert");

  wm.setMinimumSignalQuality(20);

  bool res;
  res = wm.autoConnect("AutoConnectAP"); // anonymous ap

  while(!res);
}

/* 从 EEPROM 读取 tft 信息 */
void eeprom_readtftInfo(void)
{
  // 从 eeprom 读取背光亮度设置
  if(EEPROM.read(BL_addr) > 0 && EEPROM.read(BL_addr) < 100)
    LCD_BL_PWM = EEPROM.read(BL_addr);
  // 从 eeprom 读取屏幕方向设置
  if(EEPROM.read(Ro_addr) >= 0 && EEPROM.read(Ro_addr) <= 3)
    LCD_Rotation = EEPROM.read(Ro_addr);
}

/* 从 EEPROM 读取 wifi 信息 */
void eeprom_readwifiInfo(void)
{
  uint8_t *p = (uint8_t*)(&wificonf);
  for (uint8_t i = 0; i < sizeof(wificonf); i++)
  {
    *(p + i) = EEPROM.read(i + wifi_addr);
  }
  Serial.printf("Read WiFi Config.....\r\n");
  Serial.printf("SSID:%s\r\n",wificonf.stassid);
  Serial.printf("PSW:%s\r\n",wificonf.stapsw);
  Serial.printf("Connecting.....\r\n");
}

/* 向 EEPROM 写入 wifi 信息 */
void eeprom_writewifiInfo(void)
{
  //开始写入
  uint8_t *p = (uint8_t*)(&wificonf);
  for (uint8_t i = 0; i < sizeof(wificonf); i++)
  {
    EEPROM.write(i + wifi_addr, *(p + i)); //在闪存内模拟写入
  }
  delay(10);
  EEPROM.commit();//执行写入ROM
  delay(10);
}

/* 清空 EEPROM 中的 Wifi 信息 */
void eeprom_deletewifiInfo(void)
{
  config_type deletewifi ={{""},{""}};
  uint8_t *p = (uint8_t*)(&deletewifi);
  for (uint8_t i = 0; i < sizeof(deletewifi); i++)
  {
    EEPROM.write(i + wifi_addr, *(p + i)); //在闪存内模拟写入
  }
  delay(10);
  EEPROM.commit();//执行写入ROM
  delay(10);
}

const int NTP_PACKET_SIZE = 48; // NTP时间在消息的前48字节中
byte packetBuffer[NTP_PACKET_SIZE]; //buffer to hold incoming & outgoing packets

