Jiahao-Liu29/Esp8266_DeskBox/src/mySD1/src/main.cpp
// 向NTP服务器发送请求
void sendNTPpacket(IPAddress &address)
{
  memset(packetBuffer, 0, NTP_PACKET_SIZE);

  packetBuffer[0] = 0b11100011;   // LI, Version, Mode
  packetBuffer[1] = 0;     // Stratum, or type of clock
  packetBuffer[2] = 6;     // Polling Interval
  packetBuffer[3] = 0xEC;  // Peer Clock Precision
  // 8 bytes of zero for Root Delay & Root Dispersion
  packetBuffer[12] = 49;
  packetBuffer[13] = 0x4E;
  packetBuffer[14] = 49;
  packetBuffer[15] = 52;

  udp.beginPacket(address, 123); //NTP requests are to port 123
  udp.write(packetBuffer, NTP_PACKET_SIZE);
  udp.endPacket();
}

// 获取 NTP 时间
time_t getNtpTime(void)
{
  IPAddress ntpServerIp;

  while (udp.parsePacket() > 0);

  WiFi.hostByName(ntpServerName, ntpServerIp);

  sendNTPpacket(ntpServerIp);
  uint32_t beginWait = millis();
  while (millis() - beginWait < 1500) {
    int size = udp.parsePacket();
    if (size >= NTP_PACKET_SIZE) {
      Serial.println("Receive NTP Response");
      udp.read(packetBuffer, NTP_PACKET_SIZE);  // read packet into the buffer
      unsigned long secsSince1900;
      // convert four bytes starting at location 40 to a long integer
      secsSince1900 =  (unsigned long)packetBuffer[40] << 24;
      secsSince1900 |= (unsigned long)packetBuffer[41] << 16;
      secsSince1900 |= (unsigned long)packetBuffer[42] << 8;
      secsSince1900 |= (unsigned long)packetBuffer[43];
      //Serial.println(secsSince1900 - 2208988800UL + timeZone * SECS_PER_HOUR);
      return secsSince1900 - 2208988800UL + timeZone * SECS_PER_HOUR;
    }
  }
  Serial.println("No NTP Response :-(");
  return 0; // 无法获取时间时返回0
}

void scan_num(uint16_t x, uint16_t y, int num, uint8_t weiflag, bool flag)
{
  uint8_t index_high, index_low;
  uint8_t num_high = num / 10;
  uint8_t num_low = num % 10;
  num_high > 0 ? index_high = num_high - 1: index_high = 5;
  num_low > 0 ? index_low = num_low - 1: index_low = 9;
  for(uint8_t i = 0; i < 9; i ++) {
    if(flag && weiflag==1) {
      if(index_high == 5)
      {
        tft.drawBitmap(x, y, &font_t1_64x80[5*font_t1_bytes + i*40], 32, font_t1_height-((i/2)*20), TFT_WHITE, TFT_BLACK);
        tft.drawBitmap(x, y+font_t1_height-((i/2)*20), &font_t1_64x80[0], 32, ((i/2)*20), TFT_WHITE, TFT_BLACK);
      } else
        tft.drawBitmap(x, y, &font_t1_64x80[index_high*font_t1_bytes + i*40], 32, font_t1_height, TFT_WHITE, TFT_BLACK);
    }
    tft.drawBitmap(x+32, y, &font_t1_64x80[index_low*font_t1_bytes + i*40], 32, font_t1_height, TFT_WHITE, TFT_BLACK);
  }
}

/* 时钟刷新 */
unsigned char Hour_sign   = 60;
unsigned char Minute_sign = 60;
unsigned char Second_sign = 60;
uint8_t Hour_flag = 6;
uint8_t Minute_flag = 6;
uint8_t Second_flag = 6;

//星期
String week()
{
  String wk[7] = {"日","一","二","三","四","五","六"};
  String s = "周" + wk[weekday()-1];
  return s;
}

//月日
String monthDay()
{
  String s = String(month());
  s = s + "月" + day() + "日";
  return s;
}

/* 电池电量 */
/*
* 电池电量图标有效范围 0-24
*/
void liVal(uint8_t value)
{
  eSprite.createSprite(33, 28);
  eSprite.fillSprite(TFT_BLACK);

  eSprite.drawRoundRect(2, 8, 3, 10, 1, TFT_WHITE);
  eSprite.drawRoundRect(5, 6, 28, 16, 2, TFT_WHITE);
  eSprite.fillRect(7, 8, 24, 12, TFT_GREEN);
  eSprite.fillRect(7, 8, value, 12, TFT_BLACK);
  eSprite.pushSprite(205, 2);

  eSprite.deleteSprite();
}

// 息屏时钟
void clockDisplay(uint8_t relashFlag)
{
  // 秒钟刷新
  if(second() != Second_sign || relashFlag == 1) {
    if(Second_flag != second()/10 || relashFlag == 1)
      scan_num(175, 70, second(), 1, true);
    else
      scan_num(175, 70, second(), 1, false);
    if(second() % 2 == 0) {
      tft.drawBitmap(79, 100, font_t1_symbol, 16, 32, TFT_WHITE, TFT_BLACK);
      tft.drawBitmap(159, 100, font_t1_symbol, 16, 32, TFT_WHITE, TFT_BLACK);
    } else {
      tft.drawBitmap(79, 100, font_t1_symbol, 16, 32, TFT_BLACK, TFT_BLACK);
      tft.drawBitmap(159, 100, font_t1_symbol, 16, 32, TFT_BLACK, TFT_BLACK);
    }
    Second_sign = second();
    Second_flag = second()/10;
  }
  // 分钟刷新
  if(minute() != Minute_sign || relashFlag == 1) {
    if(Minute_flag != minute()/10 || relashFlag == 1)
      scan_num(95, 70, minute(), 1, true);
    else
      scan_num(95, 70, minute(), 1, false);
    Minute_sign = minute();
    Minute_flag = minute()/10;
  }
  // 小时刷新
  if(hour() != Hour_sign || relashFlag == 1) {
    if(Hour_flag != hour()/10 || relashFlag == 1)
      scan_num(15, 70, hour(), 1, true);
    else
      scan_num(15, 70, hour(), 1, false);
    Hour_sign = hour();
    Hour_flag = hour()/10;
  }

  if(relashFlag == 1) relashFlag = 0;
  /***日期****/
  eSprite.loadFont(font_zhong);

  //星期
  eSprite.createSprite(58, 30);
  eSprite.fillSprite(TFT_BLACK);
  eSprite.setTextDatum(CC_DATUM);
  eSprite.setTextColor(TFT_WHITE, TFT_BLACK);
  eSprite.drawString(week(),29,16);
  eSprite.pushSprite(102,150);
  eSprite.deleteSprite();

  //月日
  eSprite.createSprite(95, 30);
  eSprite.fillSprite(TFT_BLACK);
  eSprite.setTextDatum(CC_DATUM);
  eSprite.setTextColor(TFT_WHITE, TFT_BLACK);  
  eSprite.drawString(monthDay(),49,16);
  eSprite.pushSprite(5,150);
  eSprite.deleteSprite();

  eSprite.unloadFont();
}

void clockShow()
{
  // 翻页时钟效果
  String secondH = String(second() / 10);
  String secondL = String(second() % 10);
  eSprite.loadFont(DINNextLTPro_Bold64);
  eSprite.createSprite(115, 60);
  eSprite.fillSprite(TFT_BLACK);
  eSprite.fillRoundRect(28, 0, 80, 60, 4, 0x8410);  // 特定颜色
  eSprite.setTextDatum(CC_DATUM);
  eSprite.setTextColor(TFT_LIGHTGREY, 0x8410); 
  eSprite.drawString(secondH, 47, 35);
  eSprite.drawString(secondL, 83, 35);
  eSprite.fillRect(28, 28, 80, 4, TFT_BLACK);
  eSprite.pushSprite(110,75);
  eSprite.deleteSprite();
  eSprite.unloadFont();
}

/* 多功能界面 */
int flashcout = 0;
void mainDisplay(uint8_t enFlag)
{
  /******************************* 静态部分 ************************************/
  // 城市名称
  eSprite.loadFont(font_zhong25);

  eSprite.createSprite(94, 30); 
  eSprite.fillSprite(TFT_BLACK);
  eSprite.setTextDatum(CC_DATUM);
  eSprite.setTextColor(TFT_WHITE, TFT_BLACK); 
  eSprite.drawString(cityArray, 44, 16);
  eSprite.pushSprite(15,10);
  eSprite.deleteSprite();

  // 天气详情
  String text = weatherInfo.text;
  uint16_t textBgColor;
  if (text == "晴")
    textBgColor = TFT_GREEN;
  else if(text == "多云")
    textBgColor = 0xA7F9;
  else if(text == "阴")
    textBgColor = TFT_LIGHTGREY;
  else
    textBgColor = 0xDD24;

