Jiahao-Liu29/Esp8266_DeskBox/src/mySD1/src/main.cpp
  eSprite.createSprite(100, 30); 
  eSprite.fillSprite(TFT_BLACK);
  eSprite.fillRoundRect(0, 0, 100, 30, 5, textBgColor);
  eSprite.setTextDatum(CC_DATUM);
  eSprite.setTextColor(TFT_BLACK, TFT_WHITE); 
  eSprite.drawString(text, 48, 16);
  eSprite.pushSprite(5, 130);
  eSprite.deleteSprite();

  /***日期****/
  String wk[7] = {"日","一","二","三","四","五","六"};
  String weekstr = "星期" + wk[weekday()-1];

  //星期
  eSprite.createSprite(80, 30);
  eSprite.fillSprite(TFT_BLACK);
  eSprite.setTextDatum(CC_DATUM);
  eSprite.setTextColor(TFT_WHITE, TFT_BLACK);
  eSprite.drawString(weekstr,40,16);
  eSprite.pushSprite(138,40);
  eSprite.deleteSprite();

  eSprite.unloadFont();

  // 天气图标
  wrat.printfweather(23, 50, weatherInfo.text);

  // 温度图标
  TJpgDec.drawJpg(5, 173, icon_temp, sizeof(icon_temp));
  // 湿度图标
  TJpgDec.drawJpg(5, 210, icon_weath, sizeof(icon_weath));

  // wifi图标
  tft.drawBitmap(170, 2, icon_wifi, 28, 28, TFT_LIGHTGREY);

  /******************************* 数据部分 ************************************/
  eSprite.loadFont(font_zhong25);
  // 温度数据
  eSprite.createSprite(68, 30); 
  eSprite.fillSprite(TFT_BLACK);
  eSprite.setTextDatum(CC_DATUM);
  eSprite.setTextColor(TFT_WHITE, TFT_BLACK); 
  eSprite.drawString(String(weatherInfo.temp) + "℃", 32, 16);
  eSprite.pushSprite(37,173);
  eSprite.deleteSprite();

  // 湿度数据
  eSprite.createSprite(68, 30); 
  eSprite.fillSprite(TFT_BLACK);
  eSprite.setTextDatum(CC_DATUM);
  eSprite.setTextColor(TFT_WHITE, TFT_BLACK); 
  eSprite.drawString(String(weatherInfo.rh) + "%", 32, 16);
  eSprite.pushSprite(37,210);
  eSprite.deleteSprite();

  eSprite.unloadFont();

  // 分钟刷新
  tft.drawBitmap(177, 175, font_t2_60x64[minute()/10], 30, 64, TFT_BROWN, TFT_BLACK);
  tft.drawBitmap(210, 175, font_t2_60x64[minute()%10], 30, 64, TFT_BROWN, TFT_BLACK);
  // 小时刷新
  tft.drawBitmap(102, 175, font_t2_60x64[hour()/10], 30, 64, TFT_GREENYELLOW, TFT_BLACK);
  tft.drawBitmap(134, 175, font_t2_60x64[hour()%10], 30, 64, TFT_GREENYELLOW, TFT_BLACK);

  /******************************* 动态部分 ************************************/
  // 秒刷新
  // 动态点
  if (second() % 2 == 0) {
    tft.drawBitmap(166, 191, font_t2_symbol, 8, 32, TFT_WHITE, TFT_BLACK);
  } else {
    tft.drawBitmap(166, 191, font_t2_symbol, 8, 32, TFT_BLACK, TFT_BLACK);
  }

  // 天气详情以及日期刷新
  // 每 7 秒刷新一次天气详情
  if (second() % 8 == 0)
  {
    flashcout = second();
    infoShow = true;
  }
  else if(second() == flashcout + 2)
  {
    flashcout = 0;
    infoShow = false;
  }
  if (infoShow) {
    eSprite.loadFont(font_zhong25);

    eSprite.createSprite(130, 100);  // 创建区域
    eSprite.fillScreen(TFT_BLACK);  // 覆盖区域

    // 最高 / 最低气温
    eSprite.setTextDatum(CC_DATUM);
    eSprite.setTextColor(0xFB08, TFT_BLACK);
    eSprite.drawString(String(forecastsInfo[0].high), 35, 20);
    eSprite.setTextColor(TFT_WHITE, TFT_BLACK);
    eSprite.drawString(" / ", 60, 20);
    eSprite.setTextColor(0x07FF, TFT_BLACK);
    eSprite.drawString(String(forecastsInfo[0].low), 85, 20);
    eSprite.setTextColor(TFT_WHITE, TFT_BLACK);
    eSprite.drawString("℃", 110, 20);
    
    // 风力风向
    eSprite.setTextColor(TFT_WHITE, TFT_BLACK);
    eSprite.drawString(forecastsInfo[0].wc_day, 60, 53);
    eSprite.setTextColor(TFT_WHITE, TFT_BLACK);
    eSprite.drawString(forecastsInfo[0].wd_day, 60, 86);

    eSprite.pushSprite(110, 75);
    eSprite.deleteSprite(); // 释放对象

    eSprite.unloadFont();
  } else {
    eSprite.loadFont(font_zhong25);

    //年月
    eSprite.createSprite(180, 30);
    eSprite.fillSprite(TFT_BLACK);
    eSprite.setTextDatum(CC_DATUM);
    eSprite.setTextColor(TFT_WHITE, TFT_BLACK);  
    eSprite.drawString(String(year()) + "年" + String(month()) + "月",65,16);
    eSprite.pushSprite(110,145);
    eSprite.deleteSprite();

    eSprite.unloadFont();

    // 日期 (日历效果)
    eSprite.loadFont(DINNextLTPro_Bold64);
    eSprite.createSprite(130, 70);
    eSprite.fillSprite(TFT_BLACK);
    eSprite.fillRoundRect(28, 0, 80, 60, 4, 0x8410);  // 特定颜色
    eSprite.setTextDatum(CC_DATUM);
    eSprite.setTextColor(TFT_LIGHTGREY, 0x8410); 
    eSprite.drawString(String(day()), 65, 35);
    eSprite.fillRect(28, 28, 80, 4, TFT_BLACK);
    eSprite.pushSprite(110, 75);
    eSprite.deleteSprite();
    eSprite.unloadFont();
  }
} 

// 设置界面
struct setMenuItem
{
  uint8_t menuNum;					        /*当前菜单条目数*/
	char *prtStr;						          /*当前项目要显示的内容*/
	void (*fun)(void);					      /*当前项目对应的功能函数*/
	struct setMenuItem *childrenMenu_T;	/*当前项目的子菜单*/
	struct setMenuItem *parentMenu_T;		/*当前项目的父菜单*/
};

// struct setMenuItem screenMenu[1] =
// {
//   {1, (char *)"屏幕亮度", NULL, NULL, setMainMenu},
// };

/* 定义父菜单 */
setMenuItem setMainMenu[4] =
{
  {4, (char *)"屏幕亮度", NULL, NULL, NULL},
  {4, (char *)"屏幕方向", NULL, NULL, NULL},
  {4, (char *)"更新周期", NULL, NULL, NULL},
  {4, (char *)"wifi信息", NULL, NULL, NULL},
};

setMenuItem *ptrSelectMenu = setMainMenu;
int indexnum = 0;  // 标号
uint8_t addtime = 0;
uint8_t movetime = 0;
/* 菜单刷新 */
void setMenuDis(void)
{
  eSprite.loadFont(font_zhong25);

  for (uint8_t i = 0; i < ptrSelectMenu->menuNum; i++)
  {
    eSprite.createSprite(140, 50);
    eSprite.setTextDatum(CC_DATUM);
    // 选中效果
    if (i == indexnum) {
      // 背景框动态增大
      eSprite.fillRoundRect(18-(addtime/5*2), 4-(addtime/5), 104+(addtime/5*4), 30+(addtime/5), 2, TFT_WHITE);
      eSprite.setTextColor(TFT_BLACK, TFT_WHITE); // 设置反色
      // 分隔线动态增大
      eSprite.fillRect(25-addtime, 41-(addtime / 10), 90+(addtime*2), 2+(addtime/10), TFT_WHITE); // 分隔线
    } 
    // 上一个对象效果
    else if (i == ((indexnum - 1) < 0 ? 3 : indexnum - 1) ) {
      // 分隔线动态减小
      eSprite.fillRect(5+addtime, 41+(addtime/10), 130-(addtime*2), 4-(addtime/10), TFT_WHITE); // 分隔线
    }
    else {
      eSprite.setTextColor(TFT_WHITE, TFT_BLACK); // 正常颜色
      eSprite.fillRect(25, 41, 90, 2, TFT_WHITE); // 分隔线
    }
    eSprite.drawString((ptrSelectMenu+i)->prtStr, 70, 19);
    // (55, i*50+40)
    if (i == 0 || i == 1)
      eSprite.pushSprite(movetime*5+5, i*50+40);
    else {
      eSprite.pushSprite(235 - movetime*18, i*50+40);

      /* 前一帧清屏 */
      eSprite.createSprite(20, 50);
      eSprite.fillSprite(TFT_BLACK);
      eSprite.pushSprite(375 - movetime*18, i*50+40);
      eSprite.deleteSprite();
      /* 前一帧清屏 */
    }

    eSprite.deleteSprite();
  }

  eSprite.unloadFont();
  // 动态递增
  addtime++;
  if (addtime >= 20)
    addtime = 20;
  movetime++;
  if (movetime >= 10)
    movetime = 10;
}

/* 屏幕亮度设置 */
void SCREEN_SET(void)
{
  // 汉字提示
  eSprite.loadFont(font_zhong25);

  eSprite.createSprite(110, 30);
  eSprite.setTextDatum(CC_DATUM);
  eSprite.setTextColor(TFT_WHITE, TFT_BLACK);
  eSprite.drawString((ptrSelectMenu+indexnum)->prtStr, 55, 15);
  eSprite.pushSprite(65, 40);
  eSprite.deleteSprite();

  eSprite.unloadFont();

  // 箭头 上
  eSprite.createSprite(20, 10);
  eSprite.fillTriangle(3, 10, 10, 0, 17, 10, TFT_WHITE);
  eSprite.pushSprite(110, 81);
  eSprite.deleteSprite();

  // 设置进度条
  // 最大 86
  eSprite.createSprite(20, 104);
  eSprite.drawRect(5, 0, 10, 104, TFT_WHITE);
  eSprite.fillRect(7, 102-LCD_BL_PWM, 6, LCD_BL_PWM, TFT_GREEN);
  eSprite.pushSprite(110, 101);
  eSprite.deleteSprite();

  // 数字提示
  eSprite.loadFont(font_zhong25);
  eSprite.createSprite(75, 35);
  eSprite.setTextDatum(CC_DATUM);
  eSprite.setTextColor(TFT_WHITE, TFT_BLACK);
  eSprite.drawString(String(LCD_BL_PWM), 37, 17);
  eSprite.pushSprite(135, 138);
  eSprite.deleteSprite();
  eSprite.unloadFont();

  // 箭头 下
  eSprite.createSprite(20, 11);
  eSprite.fillTriangle(3, 0, 10, 10,  17, 0, TFT_WHITE);
  eSprite.pushSprite(110, 214);
  eSprite.deleteSprite();
}

