Jiahao-Liu29/Esp8266_DeskBox/src/mySD1/src/main.cpp
/* 屏幕显示方向设置 */
void ROTATION_SET(void)
{
  tft.fillScreen(TFT_BLACK);
  // 汉字提示
  eSprite.loadFont(font_zhong25);

  eSprite.createSprite(160, 60);
  eSprite.drawRoundRect(0, 0, 160, 60, 4, TFT_WHITE);
  eSprite.setTextDatum(CC_DATUM);
  eSprite.setTextColor(TFT_WHITE, TFT_BLACK);
  eSprite.drawString("暂不支持设置", 80, 30);
  eSprite.pushSprite(40, 90);
  eSprite.deleteSprite();

  eSprite.unloadFont();
}

/* 更新周期设置 */
uint8_t scroll;
byte addFlag = 0;
byte minFlag = 0;
void REFLASH_SET(void)
{
  // 汉字提示
  eSprite.loadFont(font_zhong25);

  eSprite.createSprite(110, 30);
  eSprite.setTextDatum(CC_DATUM);
  eSprite.setTextColor(TFT_WHITE, TFT_BLACK);
  eSprite.drawString((ptrSelectMenu+indexnum)->prtStr, 55, 15);
  eSprite.pushSprite(65, 40);
  eSprite.deleteSprite();

  eSprite.createSprite(30, 30);
  eSprite.setTextDatum(CC_DATUM);
  eSprite.setTextColor(TFT_WHITE, TFT_BLACK);
  eSprite.drawString("每", 15, 15);
  eSprite.pushSprite(50, 120);
  eSprite.deleteSprite();

  String timeList[25] = {" ", "01", "02", "03", "04", "05", "06", "07", "08", "09",\
                    "10", "11", "12", "13", "14", "15", "16", "17", "18",\
                    "19", "20", "21", "22", "23", "24"};

  eSprite.createSprite(80, 120);
  eSprite.fillRoundRect(0, 0, 80, 120, 4, TFT_DARKGREY);
  eSprite.setTextDatum(CC_DATUM);
  eSprite.drawRect(5, 35, 70, 2, 0xAD55);
  eSprite.setTextColor(TFT_WHITE, TFT_BLACK);

  // if ((updateweater_time-1) != 0)
  //   eSprite.drawString(timeList[updateweater_time-1], 40, 20);
  // eSprite.drawString(timeList[updateweater_time], 40, 60);
  // if ((updateweater_time+1) != 25)
  // eSprite.drawString(timeList[updateweater_time+1], 40, 100);

  // 当前更新间隔数值
  if (addFlag == 0) {
    if (updateweater_time > 2)
      eSprite.drawString(timeList[updateweater_time-2], 40, 20 - (scroll));
    for (uint8_t i = updateweater_time; i < 25; i++) {
      eSprite.drawString(timeList[i-1], 40, ((i-updateweater_time)*40)+20 - (scroll - 40));
    }
  } 
  else if (minFlag == 1) {
    if (updateweater_time > 1)
      eSprite.drawString(timeList[updateweater_time-1], 40, (scroll) - 20);
    for (uint8_t i = updateweater_time; i < 25; i++) {
      eSprite.drawString(timeList[i], 40, ((i-updateweater_time)*40)+20 + (scroll));
    }
  }
  else if (addFlag == 1) {
    for (uint8_t i = updateweater_time; i < 25; i++) {
      eSprite.drawString(timeList[i-1], 40, ((i-updateweater_time)*40)+20);
    }
  }
  
  eSprite.drawRect(5, 80, 70, 2, 0xAD55);
  eSprite.pushSprite(80, 80);
  eSprite.deleteSprite();

  eSprite.createSprite(55, 30);
  eSprite.setTextDatum(CC_DATUM);
  eSprite.setTextColor(TFT_WHITE, TFT_BLACK);
  eSprite.drawString("小时", 24, 15);
  eSprite.pushSprite(160, 120);
  eSprite.deleteSprite();

  eSprite.unloadFont();

  if (addFlag == 0 || minFlag == 1) {
    scroll++;
    if(scroll >= 40) {
      scroll = 40;
      addFlag = 1;
      minFlag = 0;
    }
  }
}

/* wifi信息设置 */
void WIFIINFO_SET(void)
{
  // 13 次
  uint8_t timeDelay = 0;
  while(true) {
  // 汉字提示
  eSprite.loadFont(font_zhong25);

  /* 前一帧清屏 */
  eSprite.createSprite(20, 30);
  eSprite.fillSprite(TFT_BLACK);
  eSprite.pushSprite((timeDelay)*13-130, 40);
  eSprite.deleteSprite();
  /* 前一帧清屏 */

  eSprite.createSprite(110, 30);
  eSprite.setTextDatum(CC_DATUM);
  eSprite.setTextColor(TFT_WHITE, TFT_BLACK);
  eSprite.drawString((ptrSelectMenu+indexnum)->prtStr, 55, 15);
  // 位置 （65, 40）
  eSprite.pushSprite(timeDelay*13-110, 40);
  eSprite.deleteSprite();

  eSprite.createSprite(200, 60);
  eSprite.fillRoundRect(0, 0, 200, 64, 4, TFT_DARKGREY);
  eSprite.setTextDatum(CL_DATUM);
  eSprite.setTextColor(TFT_WHITE, TFT_BLACK);
  eSprite.drawString("WIFI: ", 5, 15);
  eSprite.setTextColor(TFT_GREEN, TFT_BLACK);
  eSprite.drawString(wificonf.stassid, 20, 45);
  // (20, 90)
  eSprite.pushSprite(200-((timeDelay / 2) * 30), 90);
  eSprite.deleteSprite();

  eSprite.createSprite(200, 60);
  eSprite.fillSprite(TFT_DARKGREY);
  eSprite.setTextDatum(CL_DATUM);
  eSprite.setTextColor(TFT_WHITE, TFT_BLACK);
  eSprite.drawString("SSID: ", 5, 15);
  eSprite.setTextColor(TFT_GREEN, TFT_BLACK);
  eSprite.drawString(wificonf.stapsw, 20, 45);
  // (20, 90)
  eSprite.pushSprite(200-((timeDelay / 2) *30), 150);
  eSprite.deleteSprite();

  /* 前一帧清屏 */
  eSprite.createSprite(20, 120);
  eSprite.fillSprite(TFT_BLACK);
  eSprite.pushSprite(400-((timeDelay / 2) * 30), 90);
  eSprite.deleteSprite();
  /* 前一帧清屏 */

  eSprite.unloadFont();

  timeDelay++;
  // delay(200);
  if (timeDelay >= 14)
    break;
  }
}

// 是否保存设置
void isSaveMenu(void)
{
  tft.fillScreen(TFT_BLACK);  // 清屏

  eSprite.loadFont(font_zhong25);

  eSprite.createSprite(120, 60);
  eSprite.drawRoundRect(0, 0, 120, 60, 4, TFT_WHITE);
  eSprite.setTextDatum(CC_DATUM);
  eSprite.setTextColor(TFT_WHITE, TFT_BLACK);
  eSprite.drawString("是否保存", 60, 30);
  eSprite.pushSprite(30, 90);
  eSprite.deleteSprite();

  eSprite.createSprite(60, 140);
  eSprite.setTextDatum(CC_DATUM); 
  eSprite.setTextColor(TFT_SKYBLUE, TFT_BLACK);
  eSprite.drawString("√", 5, 30);
  eSprite.drawString("→", 30, 30);
  eSprite.fillRoundRect(50, 5, 20, 60, 4, TFT_WHITE);
  eSprite.setTextColor(TFT_BROWN, TFT_BLACK);
  eSprite.drawString("×", 5, 110);
  eSprite.drawString("→", 30, 110);
  eSprite.fillRoundRect(50, 85, 20, 60, 4, TFT_WHITE);
  eSprite.pushSprite(180, 60);
  eSprite.deleteSprite();

  eSprite.unloadFont();
}

// 屏幕亮度调节菜单回调函数
byte Button1_flag = 0;
byte Button2_flag = 0;
void valChange(void)
{
  if (menu_flag & SELECT_MENU) {
    switch (indexnum)
    {
    case 0: {
      if (Button1_flag) {
        LCD_BL_PWM++;
        Button1_flag = 0;
      }
      else if (Button2_flag) {
        LCD_BL_PWM--;
        Button2_flag =0;
      }
      analogWrite(LCD_BL_PIN, tft_CalBL(LCD_BL_PWM)); 
      SCREEN_SET();
    } break;
    case 2: {
      scroll = 0;
      if (Button1_flag) {
        addFlag = 0;
        updateweater_time < 25 ? updateweater_time++ : updateweater_time=24;
        Button1_flag = 0;
      }
      else if (Button2_flag) {
        minFlag = 1;
        updateweater_time > 1 ? updateweater_time-- : updateweater_time=1;
        Button2_flag = 0;
      }
    } break;
    default:
      break;
    }
  }
}

/* 按键选中回调函数 */
void keyCenter_CallBack(void)
{
  tft.fillScreen(TFT_BLACK);  // 清屏
  menu_flag &= ~SET_MENU; // 首先清除设置界面
  menu_flag |= SELECT_MENU;
  if (indexnum == 0) {
    SCREEN_SET();
  }
  else if (indexnum == 1) {
    ROTATION_SET();
    delay(1000);
    menu_flag |= SET_MENU;
    menu_flag &= ~SELECT_MENU;
    tft.fillScreen(TFT_BLACK);
    movetime = 0;
  } 
  else if (indexnum == 2) {
    REFLASH_SET();
  }
  else if (indexnum == 3) {
    WIFIINFO_SET();
  }
}

void setDisplay(void)
{
  // y - 35 开始
  setMenuDis();
}

void apiRequest(uint8_t flag)
{
  // 判断 tcp 是否处于连接状态，不是就建立连接
  while (!wifiClient.connected()) {
    if(!wifiClient.connect(host, 80)) {
      wifiClient.println("connection....");
    }
  }
  Serial.println("Successed!");

  // flag == 1 只更新天气
  if (flag == 1)
    weatherRequest(cityID);
  else {
    // 否则都更新
    cityIDRequest(cityArray);
    delay(100);
    weatherRequest(cityID);
  }
  wifiClient.stop();
}


