Jiahao-Liu29/Esp8266_DeskBox/src/mySD1/src/main.cpp
/* tft 刷新 */
void tft_reflash(void)
{
  liVal(10);
  // 低功耗界面
  if(menu_flag & LOW_POWER) {
    if(now() != prevDisplay) {
      prevDisplay = now();
      clockDisplay(0);
    }
  } 
  // 多功能界面
  else if (menu_flag & MAIN_MENU) {
    // menu_flag &= ~MAIN_MENU;
    mainDisplay(0);
  }
  // 设置界面
  else if (menu_flag & SET_MENU) {
    setDisplay();
  }
  else if (menu_flag & SELECT_MENU) {
    if (indexnum == 2) {
      REFLASH_SET();  // 有动画，要动态刷新
    }
  }

  /* 天气更新 */
  // 一个小时更新一次
  if(hour() - weaterTime >= updateweater_time)
  {
    if(Wifi_en == 0)
    {
      WiFi.forceSleepWake();  //wifi on
      Serial.println("WIFI恢复......");
      Wifi_en = 1;
    }

    if(WiFi.status() == WL_CONNECTED)
    {
      Serial.println("WIFI已连接");

      apiRequest(updata_flag); // 只更新天气
      
      weaterTime = hour();
      while(!getNtpTime());
      WiFi.forceSleepBegin(); // Wifi Off
      Serial.println("WIFI休眠......");
      Wifi_en = 0;
    }
  }
}

/* esp 复位 */
void esp_reset(Button2& btn){
  ESP.restart();
}

/* wifi 复位 */
void wifi_reset(Button2& btn){
  wm.resetSettings();
  eeprom_deletewifiInfo();
  delay(10);
  Serial.println("重置WiFi成功");
  ESP.restart();
}

/* 界面切换 */
uint8_t button_sw1Flag = 0;
void menu_change(Button2& btn)
{
  if (menu_flag & SELECT_MENU) {
    Button1_flag = 1;
    valChange();
  }
  else if (menu_flag & SET_MENU) {
    keyCenter_CallBack();
  }

  if (!(menu_flag & SELECT_MENU)) {
    tft.fillScreen(TFT_BLACK);  // 清屏
    Serial.println("model changed!");
  }

  if (button_sw1Flag == 0) {
    // 低功耗界面
    menu_flag |= LOW_POWER;
    menu_flag &= ~SET_MENU;
    clockDisplay(1);
  } else if (button_sw1Flag == 1)
  {
    // 多功能界面
    menu_flag |= MAIN_MENU;
    menu_flag &= ~LOW_POWER;
  } else if (button_sw1Flag == 2 && !(menu_flag & SET_MENU) && !(menu_flag & SELECT_MENU)) {
    // 设置界面
    menu_flag |= SET_MENU;
    menu_flag &= ~MAIN_MENU;
    TJpgDec.drawJpg(72, 72, icon_set, sizeof(icon_set));
    delay(1000);
    tft.fillScreen(TFT_BLACK);
  }

  
  if (menu_flag & ISSAVE_MENU) {
    // 保存
    menu_flag |= SET_MENU;
    menu_flag &= ~ISSAVE_MENU;
    // 保存更改
    if (indexnum == 0) {
      // 更新背光
      if(EEPROM.read(BL_addr) != LCD_BL_PWM)
      {
        EEPROM.write(BL_addr, LCD_BL_PWM);
        EEPROM.commit();
        delay(5);
      }
    } else if (indexnum == 2) {
      // 更新天气更新间隔
      if(EEPROM.read(weather_addr) != updateweater_time) 
      {
        EEPROM.write(weather_addr, updateweater_time);
        EEPROM.commit();
        delay(5);
      }
    }
    movetime = 0;
  }
  else if (!(menu_flag & SET_MENU) || !(menu_flag & SELECT_MENU)) {
    button_sw1Flag++;
    Serial.println(button_sw1Flag);
    // 达到最大菜单数
    // if (button_sw1Flag == menu_num) {
    //   button_sw1Flag = 0;
    // }
  }
}

// +
void key_up(Button2& btn)
{
  if (menu_flag & SET_MENU) {
    addtime = 0;
    if(++indexnum >= setMainMenu->menuNum)
    {
      indexnum = 0;
    }
    setMenuDis();
  } 
  else if (menu_flag & ISSAVE_MENU) {
    // 不保存
    menu_flag |= SET_MENU;
    menu_flag &= ~ISSAVE_MENU;
    if (indexnum == 0) {
      // 不更背光
      if (EEPROM.read(BL_addr) != LCD_BL_PWM) {
        LCD_BL_PWM = EEPROM.read(BL_addr);
        analogWrite(LCD_BL_PIN, tft_CalBL(LCD_BL_PWM)); 
      }
    } else if (indexnum == 2) {
      // 不更新天气更新间隔
      if (EEPROM.read(weather_addr) != updateweater_time) {
        updateweater_time = EEPROM.read(weather_addr);
      }
    }
    tft.fillScreen(TFT_BLACK);
    movetime = 0;
  }
  else {
    Button2_flag = 1;
    valChange();
  }
}

/* 是否保存界面 */
void exit_set(Button2& btn)
{
  if (menu_flag & SELECT_MENU) {
    menu_flag |= ISSAVE_MENU;
    menu_flag &= ~SELECT_MENU;
    if (indexnum != 3)
      isSaveMenu();
    else {
      menu_flag |= SET_MENU;
      menu_flag &= ~ISSAVE_MENU;
      menu_flag &= ~SELECT_MENU;
      tft.fillScreen(TFT_BLACK);
      movetime = 0;
    }
  } else if (menu_flag & SET_MENU) {
    tft.fillScreen(TFT_BLACK);
    menu_flag |= LOW_POWER;
    menu_flag &= ~SET_MENU;
    clockDisplay(1);
    button_sw1Flag = 1;
    indexnum = 0;
    movetime = 0;
  }
}

void setup() {
  // Button_sw1.setClickHandler(esp_reset);
  // Button_sw1.setLongClickHandler(wifi_reset);
  Button_sw1.setClickHandler(menu_change);
  Button_UP.setClickHandler(key_up);
  Button_UP.setLongClickDetectedHandler(exit_set);
  Serial.begin(115200); 
  EEPROM.begin(1024); // EEPROM 初始化

  eeprom_readtftInfo();

  pinMode(LCD_BL_PIN, OUTPUT); 
  analogWrite(LCD_BL_PIN, tft_CalBL(LCD_BL_PWM));  

  /* tft 初始化 */
  tft.init();
  tft.fillScreen(TFT_BLACK);            //屏幕颜色

  /* wifi初始化 */
  eeprom_readwifiInfo();
  WiFi.begin(wificonf.stassid, wificonf.stapsw);

  TJpgDec.setJpgScale(1);
  TJpgDec.setSwapBytes(true);
  TJpgDec.setCallback(tft_output);

  liVal(20);

  while (WiFi.status() != WL_CONNECTED) {
      loading(30);

      if(loadNum >= 194)
      {
          Web_win();
          WebConfig();
      }
  }
  delay(10);
  while(loadNum < 194) //让动画走完
  { 
      loading(1);
  }

  if(WiFi.status() == WL_CONNECTED)
  {
      Serial.print("SSID:");
      Serial.println(WiFi.SSID().c_str());
      Serial.print("PSW:");
      Serial.println(WiFi.psk().c_str());
      strcpy(wificonf.stassid,WiFi.SSID().c_str());//名称复制
      strcpy(wificonf.stapsw,WiFi.psk().c_str());//密码复制
      eeprom_writewifiInfo();
      eeprom_readwifiInfo();
  }

  // 更新城市并获取天气
  apiRequest(0);

  Serial.print("本地IP： ");
  Serial.println(WiFi.localIP());

  // NTP 启动
  Serial.println("启动UDP");
  udp.begin(localPort);
  Serial.println("等待同步...");
  setSyncProvider(getNtpTime);
  setSyncInterval(300);

  weaterTime = hour(); // 天气更新标志赋值

  menu_flag |= SET_MENU; // 状态机赋值
  button_sw1Flag = 3;     // 按键标志赋值

  tft.fillScreen(TFT_BLACK);//清屏

  WiFi.forceSleepBegin(); // wifi休眠
  Serial.println("WIFI休眠......");
  Wifi_en = 0;
}
 
void loop() {
  tft_reflash();
  Button_sw1.loop(); //按钮轮询
  Button_UP.loop();
  // display_num();
}